{"add": 26426, "yard": 214, "docs": 4207, "to": 95144, "faker": 908, ":": 88412, ":json": 8, "[sep]": 74648, ".": 371932, "complete": 678, "for": 50386, "methods": 1570, ":json.fix": 1, "non-continuing": 1, "comment": 1219, "line": 2769, "error": 7248, "`": 40000, "mysqli_warning": 3, ":next": 4, "will": 8952, "return": 2853, "bool": 282, "this": 34302, "change": 11938, "is": 45481, "(": 54792, ")": 58234, "missing": 2731, "allocator": 46, "uses": 1145, "of": 37851, "addmember": 7, "requires": 886, ",": 89484, "fix": 35299, "keeps": 113, "all": 7156, "consistent": 535, "across": 277, "the": 143668, "whole": 282, "tutorial": 312, "in": 57715, "document": 869, "typo": 1633, "documentation": 7768, "file": 6170, "templates.md": 3, "i": 15651, "noticed": 336, "a": 53588, "misspelling": 25, "``": 17033, "occurance": 2, "''": 21480, "should": 6090, "be": 17650, "occurrence": 16, "templates.md.frozen-due-to-age": 2, "_allkeys": 2, "descriptor": 64, "object.keys": 21, "behavior": 1500, "by": 10787, "default": 5562, "provide": 726, "plugins": 885, "with": 25004, "options": 2220, "that": 18312, "respond": 57, "possible": 1219, "keys": 742, "mimic": 17, "v2": 512, "had": 887, "merged": 405, "behavior.type": 1, "enhancement": 1263, "\\_allkeys": 1, "containskey": 4, "called": 892, "null": 2558, "if": 19736, "cookie": 237, "auth": 468, "not": 24747, "used": 4425, "_cookieauthenticationoptions.cookie.name": 1, "authentication": 356, "or": 10204, "identity": 104, "used.bug": 1, "infer": 82, "private": 758, "properties": 764, "constructor": 406, "even": 1282, "typehinted": 6, "hi": 177, "!": 3164, "when": 18746, "using": 5740, "flag": 1096, "inferprivatepropertytypefromconstructor": 4, "true": 1665, "inference": 202, "disabled": 710, "property": 1261, "natively": 20, "however": 856, "could": 1767, "more": 5044, "specific": 818, "type": 4483, "eg": 137, "generic": 356, "usecase": 17, "orm": 50, "class": 3199, "userrepository": 3, "{": 6605, "databaseclient": 3, "$": 9788, "db": 879, ";": 7951, "public": 1340, "function": 3882, "__construct": 37, "databaseclientprovider": 1, "dbclientprovider": 1, "this-": 436, ">": 12473, "=": 7751, "dbclientprovider-": 1, "user": 3982, ":class": 147, "}": 6413, "get": 2680, "string": 3744, "id": 1510, "db-": 1, "query": 1998, "'": 19384, "...": 2581, "pr": 22879, "allows": 1257, "phpstan": 164, "<": 5651, "instead": 4145, "just": 2564, "on": 23569, "precise": 55, "than": 2086, "native": 460, "typehint": 29, "..": 9359, "test": 12874, "cases": 1412, "typed": 94, "inferences": 2, "from": 15235, "files": 5403, "required": 1229, "validation": 935, "my": 3242, "bug": 8430, "main": 1880, "update": 11057, "plugin": 2799, "commit": 3448, "following": 2159, "problems": 386, "impossible": 122, "set": 5960, "field": 1177, "media": 498, "as": 14413, "hardcode": 29, "display": 984, "view": 1488, "message": 2561, "and": 49787, "remove": 8926, "it": 21680, "again": 622, "then": 1953, "successful": 127, "checked": 409, "but": 6200, "empty": 2033, "files-required-validation": 1, "prop": 133, "save": 422, "component": 761, "repeatedly.merge": 1, "branch": 9874, "'master": 2652, "into": 8909, "fix/files-required-validation.source": 1, "content-manager": 258, "firefox": 148, "scrollbar": 89, "color": 947, "regression": 459, "hypertable": 249, "continuous": 267, "aggregates": 110, "'s": 7204, "schema": 496, "name": 4588, "information": 1167, "since": 2281, "these": 2039, "fields": 611, "where": 3421, "new": 16939, "use": 11024, "same": 2871, "names": 1138, "order": 1512, "other": 3762, "views": 223, "reference": 1715, "[": 26390, "jenkins-62515": 1, "]": 26203, "-": 14192, "introduce": 405, "css": 697, "variables": 812, "login": 288, "screen": 402, "implies": 33, "colors": 293, "picked": 69, "up": 3006, "internet": 63, "explorer": 82, "11": 147, "still": 1535, "retains": 12, "good": 1003, "look": 520, "feel": 974, "chrome": 193, "dark": 197, "theme": 451, "support": 8186, "changelog": 2086, "entries": 868, "upgrade": 1962, "guidelines": 884, "are": 13937, "appropriate": 664, "audience": 316, "affected": 1467, "users": 2529, "developer": 482, "depending": 502, "examples": 2647, "fill-in": 280, "section": 1529, "only": 7234, "there": 4692, "breaking": 2936, "changes": 11730, "which": 7365, "may": 2165, "require": 1187, "extra": 1100, "steps": 897, "during": 1562, "@": 320, "before": 4337, "marked": 609, "ready-for-merge": 311, "title": 5529, "and/or": 533, "correct": 3717, "needs": 1681, "additional": 1157, "upgrade-guide-needed": 310, "label": 1171, "example": 3723, "would": 3468, "make": 8454, "sense": 858, "backport": 475, "lts": 388, "jira": 1053, "issue": 8761, "must": 908, "exist": 1124, "improvement": 721, "labeled": 331, "lts-candidate": 312, "considered": 936, "see": 2482, "restore": 448, "ie11": 42, "compat": 82, "background": 567, "focus.ready-for-merge.rfe": 1, "home_z_first": 3, "option": 4032, "homing": 75, "probe": 124, "usually": 275, "safe": 347, "home": 255, "z": 200, "first": 2178, "so": 6311, "adds": 2792, "option.c": 2, "configuration.c": 11, "motion.f": 5, "calibration": 18, "build": 5695, "deps": 267, "bump": 1102, "system.net.http.winhttphandler": 30, "version": 14140, "bumps": 189, "release": 2568, "notes": 552, "sourced": 135, "releases": 257, ".net": 361, "core": 1507, "rc1": 17, "known": 235, "issues": 2517, "download": 312, "install": 1285, "repos": 67, "coreclr": 33, "corefx": 41, "core-setup": 10, "cli": 610, "commits": 658, "full": 777, "diff": 444, "compare": 355, "dependabot": 693, "resolve": 645, "any": 2847, "conflicts": 671, "long": 986, "you": 7327, "do": 8488, "n't": 8435, "alter": 360, "yourself": 219, "commands": 960, "can": 8196, "trigger": 579, "actions": 650, "commenting": 203, "additionally": 335, ".dependabot/config.yml": 74, "repo": 745, "frequency": 199, "including": 522, "time": 4094, "day": 380, "week": 203, "automerge": 129, "never/patch/minor": 124, "dev/runtime": 124, "dependencies": 848, "pull": 1653, "request": 3005, "limits": 288, "per": 921, "run": 3766, "open": 992, "at": 5452, "out-of-range": 160, "updates": 1706, "receive": 510, "lockfile": 161, "desired": 418, "security": 1125, "6.x": 284, "builder": 296, ":withcount": 7, "binding": 358, "scope": 575, "added": 13327, "related": 1284, "model": 1102, "sub-select": 4, "current": 1953, "laravel": 97, "causes": 430, "an": 9577, "has": 6650, "bindings": 148, "attempts": 159, "column": 1343, "liked": 15, "likeable": 2, "models": 340, "loaded": 417, "likescope": 1, "implements": 277, "apply": 751, "instanceof": 82, "builder-": 8, "getquery": 3, "columns": 505, "===": 195, "select": 1353, "selectsub": 1, "like": 3227, ":wherecolumn": 1, "'likeable_id": 1, "'=": 12, "model-": 19, "gettable": 5, "'.id": 1, "wherelikeabletype": 1, "getmorphclass": 2, "whereuserid": 1, "app": 908, "selectraw": 1, "'count": 4, "'liked": 3, "because": 2991, "removes": 603, "loading": 675, "count": 792, "forgets": 9, "one-line": 12, "patch": 698, "fixes": 3796, "problem": 1281, "failing": 652, "case": 2856, "withcount": 5, "'select": 11, "constraint.remove": 2, "prevent": 1220, "relation": 210, "scoped": 70, "fixed": 7335, "input": 1262, "group": 759, "between": 1117, "two": 1479, "inputs": 179, "illustrates": 3, "usage": 1199, "form": 1058, "dimensions": 109, "width": 516, "x": 1113, "height": 237, "hour": 75, "minutes": 156, "month": 88, "&": 3357, "year": 178, "mm": 31, "/": 2910, "yyyy": 1, "range": 683, "1000": 81, "9999": 5, "username": 249, "host": 919, "inputs.merge": 3, "'main": 417, "patch-1.merge": 50, "patch-1.docs.v5": 6, "s3_read_timeout": 4, "environment": 962, "variable": 1615, "tootctl": 170, "upload": 367, "webui": 126, "client": 1201, "saw": 92, "many": 1402, "net": 75, ":readtimeout": 1, "tcpsocket": 6, "closed": 268, "5s": 13, "value": 3593, "too": 1096, "short": 268, "cheap": 14, "storage": 360, "service": 1875, "configure": 401, "read": 1629, "timeout": 568, "adding": 3404, "python3": 42, "0": 34915, "wheels": 41, "what": 3343, "?": 29161, "python": 1014, "3": 1771, "travis": 531, "tests": 15526, "support.adding": 3, "mac": 251, "update.merge": 12, "support_python37.fix.numpy": 1, "version.choose": 1, "different": 1517, "numpy": 142, "versions": 782, "version.fix": 17, "3.7": 8, "second": 597, "part": 797, "modifies": 66, "kickstart-static64.sh": 19, "pass": 3562, "--": 52644, "stable-channel": 7, "netdata-latest.gz.run": 15, "packaging/installer/kickstart-static64.sh": 2, "passes": 215, "install-or-update.sh.kickstart-static64.sh": 1, "improve": 2228, "parsing.area/docs.area/packaging": 1, "handling": 1271, "stable": 255, "installers": 14, "automatic": 190, "updater": 72, "respect": 238, "ran": 370, "usual": 71, "typo.cla": 10, "signed.tag": 857, "php8": 98, "allow": 3530, "trailing": 421, "comma": 152, "parameter": 1812, "list": 3147, "support.topic/php8.topic/tests": 1, "inherits": 33, "server": 1475, "socket": 227, "nan": 2972, "accepted": 117, "connection": 808, "inherit": 77, "autoloaders": 2, "require/require_once": 1, "via": 1168, "fake": 82, "overview": 88, "approach": 336, "goal": 129, "filereadtrapstreamwrapper": 1, "custom": 1865, "autoloader": 15, "knowledge": 920, "find": 786, "grab": 32, "path": 2559, "shut": 37, "down": 648, "rest": 532, "include": 1779, "returning": 344, "false": 1702, "stream_open": 1, "require_once": 14, "allowing": 290, "entire": 234, "occur": 157, "returned": 496, "stream_read": 1, "serve": 290, "dummy": 80, "data": 3330, "also": 4875, "valid": 727, "php": 1291, "testing": 1596, "suite": 278, "observed": 60, "no": 12816, "errors": 1857, "confirmed": 101, "updated": 3389, "code": 9149, "succeeded": 33, "sample": 532, "repository": 355, "potential": 232, "we": 9640, "simulate": 22, "beginning": 1637, "end": 1772, "include_once": 4, "try": 821, "load": 1077, "think": 1170, "okay": 46, "assume": 133, "loads": 80, "itself": 628, "later": 424, "powershell": 2001, "completion": 179, "un-hides": 1, "command": 2515, "appears": 187, "gh": 322, "help": 1183, "thus": 424, "discoverable": 13, "completion.improve": 1, "adjectives": 5, "generator": 367, "few": 772, "weeks": 36, "ago": 112, "create": 2507, "airbnb": 5, "clone": 204, "wanted": 191, "generate": 814, "flats": 1, "description": 2391, "nice": 198, "apartment": 11, "cosy": 1, "studio": 116, "did": 2013, "suitable": 38, "hence": 112, "includes": 519, "'nice": 3, "'clean": 3, "'charming": 1, "'bad": 2, "'horrible": 1, "'lazy": 5, "multiple": 1725, "purposes": 69, "real": 363, "though": 484, "touch": 136, "bank": 4, "one": 4130, "after": 4081, "having": 650, "/users/loic/desktop/playground/faker/test/faker/default/test_faker_bank.rb:51": 1, "times": 522, "51": 7, "10.times": 1, "54": 5, "refute_equal": 9, "samplebic1": 1, "samplebic2": 1, "55": 6, "56": 9, "57": 11, "/users/loic/desktop/playground/faker/test/faker/default/test_faker_bank.rb:54": 1, "block": 1309, "test_swift_bic_collission": 2, "failure": 599, "testfakerbank": 1, "aahvgb21": 2, "was": 6507, "expected": 1510, "obviously": 55, "missed": 213, "something": 674, "have": 9102, "clue": 8, "please": 3614, "let": 857, "me": 935, "know": 909, "handle": 1759, "cdata": 12, "explicit": 465, "automated": 259, "rebased": 336, "top": 905, "target": 964, "adhere": 318, "coding": 520, "standard": 717, "prerequisite": 20, "mode": 1582, "jenkins-xxxxx": 14, "great": 155, "someone": 219, "check": 6259, "ie": 131, "supported": 807, "'ve": 3627, "postcss": 60, "resolved": 211, "present": 1343, "docker": 1035, "rm": 120, "-ti": 16, "-p": 78, "8080:8080": 18, "-e": 85, "id=4752": 1, "jenkins/core-pr-tester": 16, "entry": 1440, "2": 2293, "incubating": 1, "useful": 576, "themes": 108, "jenkins": 428, "pre-processor.add": 1, "alpha": 77, "variables.yui": 1, "theming": 45, "side": 462, "panel": 278, "fixes.more": 4, "overrides.revert": 1, "overrides": 147, "reverts": 427, "a9b9310937dfa13d57061229552bc62ee5131926": 1, "manage": 174, "styles.tweak": 1, "buttons.fix": 5, "11.review": 1, "comments.standardize": 1, "link": 3868, "variables.internal.major-rfe.ready-for-merge.squash-merge-me.web-ui": 1, "tune": 425, "directory": 1334, "naming": 223, "tag.fix": 7, "test.concur": 1, "true.add": 2, "debug.merge": 2, "remote-tracking": 883, "'upstream/master": 301, "fix-tag.fix.bad": 1, "assert.iter": 1, "zs": 7, "filtering": 206, "telegraph": 6, "changelog.md": 391, "well-formatted": 296, "messages": 1653, "signed": 608, "cla": 549, "already": 1791, "ui": 2025, "labels": 689, "need": 2526, "now.fix": 2, "cleaning": 93, "test.fix": 136, "additions.fix": 1, "removing": 605, "filter": 987, "search": 991, "better": 1709, "305": 3, "contribution": 803, "detailed": 300, "described": 303, "existing": 2779, "referenced": 198, "compiles": 90, "runs": 506, "without": 2428, "coverage": 413, "100": 319, "%": 4724, "editing": 187, "source": 1935, "amalgamated": 35, "making": 582, "sources": 201, "include/nlohmann": 33, "amalgamate": 35, "single-header": 33, "single_include/nlohmann/json.hpp": 33, "process": 1348, "here": 1950, "c++11": 88, "varies": 21, "compilers": 78, "note": 2301, "some": 5289, "gcc": 141, "4": 1411, "earlier": 182, "clang": 127, "microsoft": 134, "visual": 238, "13": 86, "work": 5584, "due": 1069, "incomplete": 63, "refrain": 31, "proposing": 53, "around": 723, "compiler": 391, "limitations": 63, "ifdefs": 16, "means": 602, "specifically": 182, "am": 379, "aware": 157, "compilation": 285, "kind": 227, "bugs": 604, "understand": 347, "2016": 19, "yet": 518, "want": 1000, "drop": 801, "features": 674, "uglify": 24, "sub-standard": 15, "happy": 212, "past": 107, "shown": 269, "ways": 154, "express": 37, "functionality": 631, "such": 1060, "most": 865, "recent": 257, "msvc": 60, "unfortunately": 160, "objective": 77, "project": 1235, "break": 657, "json": 985, "conformance": 18, "propose": 148, "conformant": 15, "extension": 1247, "library": 637, "motivate": 20, "requests": 686, "address": 990, "improved": 453, "operator": 1826, "wrong": 1275, "combination": 68, "json.exception.type_error.305": 1, "container": 753, "argument": 1000, "zipbomb": 4, "forged": 4, "headers": 604, "attacks": 23, "zip": 85, "limited": 143, "creation": 468, "spam": 68, "mkldnn": 313, "deconvolution": 11, "forward": 332, "bias": 47, "deconv": 6, "out_data": 1, "reorder": 103, "broadcast": 49, "free": 1043, "inapplicable": 795, "items": 1454, "your": 2562, "starts": 1111, "mxnet-": 621, "jira_id": 1243, "refers": 662, "relevant": 802, "created": 1666, "except": 892, "prs": 896, "tiny": 712, "unit": 2108, "small": 1664, "verify": 1293, "correctness": 821, "e.g": 3036, "nightly": 951, "complicated/long-running": 747, "ones": 1025, "changing": 1264, "distributed": 1024, "kvstore": 766, "configuration": 3482, "nccl": 772, "user-facing": 1328, "api": 4246, "doc": 4965, "been": 3621, "c++": 974, "functions": 1816, "header": 3414, "their": 1795, "functionalities": 773, "arguments": 1633, "documented": 891, "readme.md": 1165, "explain": 1026, "does": 5183, "dataset": 1094, "performance": 1888, "original": 1501, "paper": 772, "applicable": 1391, "best": 1201, "either": 1379, "compatible": 1307, "bias.rerun": 1, "ci": 2177, "conn": 38, "lost": 170, "insert": 511, "panic": 438, "cause": 748, "out": 2127, "memory": 1535, "quota": 43, "caused": 654, "incorrectly": 264, "oom": 64, "oom-action": 1, "cancel": 150, "occurs": 224, "syntax": 1502, "typealternationtransformer": 12, "array": 1658, "alternation": 8, "alternation.kind/bug": 2, "long-press": 9, "menu": 647, "v": 183, "carefully": 224, "agree": 242, "them": 1973, "stream": 545, "every": 820, "playlist": 81, "info": 1489, "subconsciously": 1, "memorize": 2, "over": 1000, "consistency": 214, "thing": 277, "chose": 64, "enqueue-background": 1, "enqueue-popup": 1, "new-background": 2, "new-popup": 1, "delete-from-history": 1, "add-to-playlist": 1, "share": 230, "subscription": 92, "local": 1004, "modified": 383, "comply": 38, "above": 503, "now": 4418, "unsubscribe": 49, "unsubcribe": 1, "decided": 159, "new-on-main-player": 1, "mostly": 161, "useless": 237, "play": 170, "enqueue": 36, "while": 2451, "carrying": 7, "browsing": 28, "flawlessly": 3, "opening": 219, "player": 339, "interrupts": 14, "doing": 512, "anyway": 259, "point": 904, "details": 546, "roughly": 20, "take": 722, "click": 365, "merging": 245, "'d": 478, "those": 970, "were": 1810, "inconsistent": 155, "strings": 639, "directly": 607, "direct_on_background": 3, "start": 1495, "playing": 76, "start_here_on_background": 4, "removed": 1836, "along": 184, "start_here_on_main": 1, "longer": 898, "explained": 43, "soundcloud": 12, "video": 325, "playback": 65, "popup": 132, "ugly": 39, "if-else-cascade": 1, "crash": 863, "closing": 374, "starting/loading": 1, "apk": 135, "app-debug.zip": 56, "made": 1155, "creates": 281, "menus": 83, "unused": 783, "showstreamdialog": 3, "videodetailfragment": 19, "borrows": 4, "consistant": 7, "holds": 43, "they": 2251, "exactly": 177, "base": 752, "function.make": 2, "sub": 104, "inverted": 12, "always": 1487, "put": 387, "content-specific": 1, "imports": 255, "files.remove": 9, "dupliacte": 1, "meaning": 127, "resumeplayback": 1, "enqueued": 5, "otherwise": 456, "getcontext": 4, "getactivity": 1, "solve": 198, "refactor": 1319, "avoid": 1718, "incorrect": 968, "meaningless": 8, "inline": 291, "rescue": 135, "replace": 1133, "modifier-rescue": 1, "babel/website": 4, "q": 3955, "added/pass": 114, "spec": 599, "compliancy": 114, "license": 4116, "mit": 3876, "yes": 5672, "readme": 746, "renamed": 240, "link.pr": 1, "memo": 85, ".outdated": 285, "pinning": 25, "web": 976, "sometimes": 355, "redirecting": 43, "automapper": 24, "v10.0": 8, "v10": 27, "sure": 5031, "cloudwatch-metrics": 1, "send": 503, "counter": 120, "values": 1950, "separated": 71, "implemented": 458, "cloudwatch_test.go": 2, "teststat.testcounter": 2, "entirely": 92, "clear": 981, "generalize": 25, "particular": 190, "method": 3785, "todos": 64, "determine": 247, "actually": 898, "believe": 219, "whether": 602, "defined": 727, "cloudwatch.go": 1, "pieces": 26, "cloudwatch": 22, "metrics": 640, "reset.refactor": 1, "reset": 593, ".walk": 1, "influx": 226, "impl": 41, "object": 1914, "optional": 862, "parameters": 955, "tolerate": 1, "lables": 2, "teststat.fillcounter": 1, "samples": 308, "struct": 197, "cleaner": 65, "metrics/cloudwatch": 5, "enable": 1442, "env": 729, "pager": 76, "correctly": 1180, "args": 376, "tries": 199, "matching": 278, "fails": 774, "split": 580, "back": 1143, "interactive": 120, "manually": 535, "validated": 111, "less": 624, "-w": 67, "highlights": 19, "lien": 1, "page": 2318, "mark": 455, "anything": 491, "na": 471, "meaningful": 1697, "summarized": 1551, "facing": 264, "needed": 3212, "filed": 1498, "effectively": 1607, "changed": 3305, "feature": 9343, "significant": 1059, "affects": 908, "ready": 3390, "merge": 3087, "progress": 3430, "prefix": 4351, "wip": 3456, "parse": 520, "properly.address": 1, "feedback": 475, "quick": 238, "common": 453, "quoted": 94, "linear": 143, "gradient": 87, "striped": 6, "tables": 521, "gradient.merge": 1, "main-mc-table-perf.css.no-backport-to-v4.performance.v5": 2, "phpdocaddmissingparamannotationfixer": 11, "number": 1522, "cases.kind/bug": 11, "wiped": 6, "mangled": 7, "vars": 162, "bc": 1554, "breaks": 1561, "deprecations": 3077, "tickets": 2807, "n/a": 1398, "showing": 309, "backup": 148, "wipes": 2, "var": 659, "windows.bug.process.status": 3, "review": 1699, "rules": 545, "broad": 12, "codeowner": 5, "clarifying": 32, "format": 1700, "ingress": 241, "endpoint": 467, "clarify": 307, "providers.kubernetesingress.ingressendpoint.publishedservice": 1, "key=value": 1, "based": 1055, "once": 726, "traefik": 523, "log": 1649, "output": 1973, "saying": 53, "enter": 133, "namespace/service": 1, "simple": 632, "setup": 552, "worked": 148, "'m": 1078, "assuming": 77, "publishedservice": 1, "toml/yaml/arg": 1, "providers.kubernetesingress.ingressendpoint.publishedservice.apply": 1, "area/documentation.area/provider/k8s.area/provider/k8s/ingress.kind/enhancement.size/s": 1, "cache": 1955, "connect": 296, "rediscluster": 21, "password": 470, "currently": 1456, "redisadapter": 2, ":createconnection": 2, "'redis": 6, "localhost": 93, "localhost:6379": 3, "/var/run/redis.sock": 3, "auth=my-password": 3, "redis_cluster=1": 3, "automl": 46, "lightgbm": 199, "getting": 526, "dependency": 1138, "....": 95, "casing": 73, "evaluating": 39, "its": 2404, "matches": 195, "stableprojects": 2, "thinks": 18, "gets": 423, "unstable": 25, "case-insensitve": 2, "checks": 1086, "isstableproject": 2, "recommendation": 43, "experiment": 88, "got": 369, "smac": 1, "exception": 1515, "training": 389, "pending": 1095, "task": 768, "active": 363, "ids": 194, "stop-gap": 5, "gc": 107, "solution": 511, "scripts/format.sh": 676, "lint": 1150, "passing": 947, "ref": 173, "counts.track": 1, "deps.add": 1, "comments.fix": 58, "duplicate.merge": 2, "deps-ref-count.add": 1, "referencecounter": 3, "class.fix": 8, "test.remove": 24, "num_references": 1, "simplicity.more": 1, "tests.merge": 48, "deps-ref-count": 1, "towards": 128, "backend": 561, "architecture": 157, "tasks": 596, "actor": 253, "submitted": 84, "workers": 229, "r-package": 367, "factor": 88, "ggplot2": 8, "today": 131, "r": 895, "package": 1819, "suggests": 51, "demo": 179, "demo/leaf_stability.r": 2, "proposes": 96, "factoring": 2, "replacing": 136, "us": 652, "cut": 107, "cmd": 184, "checking": 786, "suggested": 140, "available": 1113, "importantly": 19, "expensive": 83, "anyone": 121, "installing": 258, "pay": 20, "comparisons": 52, "included": 550, "screenshots": 121, "each": 1451, "plot": 52, "below": 599, "depth": 78, "density": 6, "plots": 10, "noticeably": 5, "how": 1764, "geom_density": 1, "works": 1108, "written": 267, "years": 73, "changes.factor": 1, "ggplot2.update": 2, "ci.remove": 7, ".linting.reduce": 1, "windows.maintenance": 1, "track": 241, "downloaded": 74, "boxes": 160, "urls": 419, "state": 1404, "hooking": 8, "removal": 199, "willing": 21, "last": 1008, "night": 6, "bitten": 7, "easily": 369, "diagnosed": 1, "knew": 8, "box": 491, "basically": 146, "url": 1358, "vagrantfile": 107, "both": 1360, "newly": 125, "statefile": 3, "middleware": 533, "stack.core": 1, "scaffold": 14, "action": 604, "persisting": 7, "information.commands/box": 1, "keeping": 123, "boxes.core": 1, "write": 1195, "download.commands/box": 1, "extract": 280, "builtin": 93, "action.core": 1, "removal.commands/box": 1, "dealing": 67, "instantiation.commands/box": 1, "preparing": 34, ".commands/box": 1, "datetime": 170, "-i": 89, "provided": 569, ".core": 2, "removeboxinfo": 1, "writeboxinfo": 1, "bit": 762, "specified": 585, "vagrant": 509, "profile": 524, "design": 362, "mobile": 422, "improves": 215, "inspired": 30, "hovercard": 23, "space": 697, "under": 703, "diaspora": 83, "aspect": 121, "dropdown": 353, "selector": 167, "hovercards": 36, "very": 794, "goes": 152, "thought": 199, "idea": 241, "correcting": 26, ":ambiguousregexpliteral": 4, "autocorrection": 70, "rspec": 60, "found": 1355, "autocorrecting": 6, "expect": 278, "'hello": 44, ".to": 28, "match": 845, "/h/": 6, "produces": 114, "invalid": 1179, "ruby": 1043, "misses": 25, "paren": 8, "result": 1645, "debugged": 5, "little": 512, "autocorrector": 2, "outer": 170, "parens": 53, "rewrites": 29, "internally": 120, "invokes": 15, "properly": 992, "autocorrect": 136, "correction": 223, "attatched": 2, "specs": 167, "rubocop": 1222, "guy": 4, "confident": 16, "right": 945, "seems": 682, "relates": 365, "subject": 604, "grammatically": 358, "sentences": 376, "wrote": 430, "issue-number": 336, "exists": 894, "up-to-date": 402, "master": 2253, "rebase": 453, "bundle": 581, "exec": 404, "rake": 580, "layout/linelength": 14, "offense": 250, "really": 538, "hate": 5, "executes": 279, "own": 697, "folder": 776, "named": 443, "change_type": 66, "_": 314, "change_description": 66, ".md": 95, "introduces": 629, "user-observable": 354, "call": 1735, "receiver": 90, "auto-correct": 168, "regexp": 162, "reshare": 46, "absolute": 225, "root": 907, "post": 838, "parsing": 849, "config": 3276, "reload": 217, "exit": 476, "early": 256, "signal": 140, "typo.source": 9, "documentation.type": 79, "k8s": 237, "unreachable": 36, "rule": 585, "switch": 767, "case.woops": 1, "rule.duplicate": 1, ".add": 156, "api-test.add": 1, "tests.cleanup.area/provider/k8s/ingress.kind/bug/fix.size/l": 1, "executor": 540, "hashjoin": 13, "phase": 160, "hash": 720, "table": 2692, "system": 1160, "excessive": 40, "operation": 354, "building": 632, "assembly": 208, "transform": 319, "transformer": 82, "enough": 452, "re-instantiate": 1, "containing": 168, "registered": 218, "catalog": 156, "fail": 955, "incremented": 13, "saving": 149, "file.backed": 1, "unnecessary": 794, "change.fixed": 2, "test.disabled": 1, "tensorflow": 59, "hanging.addressed": 1, "comments": 1129, "another": 901, "backcompat.removed": 1, "statements.updated": 1, "recovery": 82, "about": 2322, "syscall": 23, "import": 1091, "google": 194, "engine": 367, "engine.add": 2, "tolower": 2, ".the": 2, "message.merge": 8, "hm.merge": 1, "hm.bug": 1, "ubuntu": 307, "18": 82, "jvm": 69, "19": 46, "eol": 79, "stopped": 110, "hosting": 40, "disco": 3, "dingo": 1, "reached": 58, "end-of-life": 3, "long-term": 10, "wo": 448, "reach": 50, "until": 507, "april": 9, "2023": 1, "'parallelize": 3, "our": 1365, "matrix": 131, "scripts": 396, "print": 559, "docstrings": 45, "cucumber": 128, "posix": 35, ":spawn": 2, "launch": 164, "jekyll.frozen-due-to-age": 3, "setter": 78, "setter.type": 1, "advice": 45, "verifypackagetree.js": 2, "wording": 213, "verifypackagetree.js.cla": 1, "gave": 34, "headache": 9, "happen": 269, "else": 423, "plan": 722, "migration": 975, "confirm": 341, "downgrade": 259, "tested": 1639, "notes.size/xs": 1, "2.x": 584, "assertvaluesonly": 5, "basetestconsumer": 9, "asserts": 51, "testobserver/testsubscriber": 1, "received": 133, "terminating": 46, "2.x.enhancement": 10, "basetestconsumer.assertvaluesonly": 1, "autoscaler": 192, "minor": 987, "minikube": 2, "cpus": 31, "cpu": 495, "rename": 845, "overlay": 123, "errorovelay": 1, "errorovelay.cla": 1, "case-sensitivity": 3, "upgrading": 149, "temporary": 265, "visibility": 181, "restoring": 62, "adapter": 152, "fragments": 55, "disabling": 156, "he": 68, "switched": 87, "pages": 700, "event": 955, "triggered": 188, "visible": 248, "happened": 102, "happens": 283, "deep": 140, "inside": 782, "copy": 693, "fragmentstatepageradapter": 4, "deprecated": 1026, "replaced": 399, "viewpager2": 7, "counterpart": 10, "fix-main-screen-menu-creation.apk.zip": 1, "asap.gui.bug": 2, "old": 1344, "admin": 1476, "warning": 1598, "needing": 52, "contrib": 46, "cleaned": 103, "surrounding": 37, "bits": 82, "framework": 1073, "manual": 794, "done": 1750, "databases": 561, "mongodb": 533, "mysql": 1383, "postgres": 603, "sqlite": 543, "warning.fix": 10, "soupette": 1, "feedback.merge": 24, "remove_old_warning_from_contrib_doc.source": 1, "dashboard": 725, "help-tooltips": 3, "styling": 214, "private-registry": 2, "nodes": 453, "deletion": 113, "cherry-pick": 56, "new-navbars": 2, "sidebar": 202, "jumps": 12, "probaby": 2, "bootstrap": 405, "approved": 48, ".area/packaging": 9, "registry": 205, "node": 1394, "right-hand": 11, "jumping": 14, "clicks": 33, "site": 731, "relying": 90, "1": 3111, "older": 255, "jekyll": 1037, "liquid": 346, "gems": 117, "hundreds": 16, "index.html": 79, "seemed": 82, "sane": 26, "way": 1577, "identify": 94, "causing": 401, "utf8": 100, "move": 1658, "contemporary": 2, "outputting": 26, "parse.test": 1, "parts.stick": 1, "standards.no": 1, "reason": 706, "'name": 77, "instance": 1029, "variable.frozen-due-to-age": 2, "batch": 433, "builds": 641, "together": 162, "running": 1451, "keep": 1672, "agents": 50, ".h": 1446, ".cpp": 1445, ".cs": 1446, ".ps1": 1452, ".psm1": 1444, "copyright": 1515, "bot": 910, "status": 2119, "running.cl-tools": 1, "store": 720, "cmake": 482, "place": 450, "place.maintenance": 1, "indicate": 160, "monitors": 46, "security-related": 4, "suggestions": 316, "improving": 72, "welcome": 156, "screenshot": 108, "indicator": 107, "global": 704, "administrative": 10, "security-related.merge": 1, "am-security-indicator.apply": 1, "badge": 125, "style.ready-for-merge.rfe": 1, "phpunitbridge": 123, "adjust": 314, "phpunit": 361, "class_alias": 13, "namespaced": 48, "projects": 229, "codeception": 2, "alias": 426, "pre-phpunit": 1, "namespaces": 109, "leading": 232, "collision": 57, "exceptions": 395, "phpunit\\framework\\exception": 1, "declare": 178, "symfony\\bridge\\phpunit\\symfonytestslistener": 2, "exits": 66, "aliased": 42, "class.bug.phpunitbridge.status": 1, "revert": 584, "guide": 808, "letsencrypt": 20, "letsencrypt.update": 1, "getting-started-with-docker-and-lets-encrypt.md.merge": 1, "master.merge": 71, "'upstream/master'.area/acme.area/documentation.kind/enhancement.size/m": 1, "amp": 34, "autowiring": 98, "httplug": 22, "httplug.feature.status": 1, "reviewed": 1642, "console": 764, "questionhelper": 11, ":gethiddenresponse": 4, "working": 1023, "5": 885, "name.bug.console.status": 1, "datachangelastmodifiedby": 3, "edited": 63, "namespace": 594, "edit": 448, "history": 300, "last_modified_by.fix": 1, "push": 336, "failed.update": 1, "style": 1163, "last_modified_by.merge": 1, "last_modified_by.refactoring": 1, "deleted": 376, "item": 649, "polyfill": 112, "5.x": 218, "expecterror": 2, "expectwarning": 2, "expectnotice": 2, "expectdeprecation": 8, "expectdeprecationtrait": 5, "quite": 280, "figure": 160, "supposed": 119, "testcase": 56, "polyfill.feature.phpunitbridge.status": 1, "2.6.x": 15, "purpose": 312, "xxxxx": 123, "brief": 165, "verifying": 180, "follow": 721, "checklist": 175, "incorporate": 143, "quickly": 236, "github_issue": 129, "trivial": 207, "typos": 532, "github": 1448, "pulling": 146, "resolves": 231, "dubbo-xxx": 129, "unknownexception": 129, "xxx": 272, "body": 600, "why": 701, "necessary": 640, "unit-test": 281, "logic": 1281, "mock": 229, "cross": 241, "module": 1400, "committed": 192, "remember": 253, "integration-test": 304, "mvn": 305, "clean": 961, "-dskiptests=false": 107, "test-compile": 129, "failsafe": 129, "large": 636, "software": 206, "donation": 132, "upporting": 1, "java": 324, "date/time": 18, "serializing": 33, "kryo": 9, "template": 1237, "latest": 741, "template.json.update": 3, "template.json.cla": 2, "underlying": 200, "tools": 272, "8.x": 323, "database_url": 7, "artisan": 57, ".env": 33, "database": 907, "throws": 257, "thrown": 241, "symfony\\component\\process\\exception\\processfailedexception": 1, "'mysql": 5, "host=": 8, "port=3306": 1, "user=forge": 1, "default-character-set=utf8mb4": 1, "'forge": 1, "failed": 914, "general": 297, "db_connection": 1, "db_host": 1, "db_port": 1, "etc": 443, "fallback": 394, "config/database.php": 1, "'url": 14, "configurationurlparser": 4, "parseconfiguration": 1, "url.update": 7, "dbcommand.php": 1, "yaml": 586, "edge": 307, "indented": 28, "blocks": 351, "comment-like": 2, "lines": 782, "ignored": 382, "subparsers": 2, "ignore": 764, "detecting": 171, "indentation": 202, "next": 676, "bug.status": 50, "reviewed.yaml": 34, "opting": 12, "caching": 312, "harder": 43, "miss": 71, "header.cla": 2, "loglevel": 30, "typeconverter": 11, "converts": 56, "ordinal": 27, "asked": 41, "sadly": 16, "fully": 247, "json.net": 3, "iconvertible": 7, "guess": 155, "price": 18, "implementing": 148, "iconvertible-interface": 3, "objects": 645, "consider": 302, "creating": 680, "pullrequest": 6, "classes": 871, "alternative": 223, "loglevel-class": 1, "typeconverter-attribute": 1, "typecode.string": 1, "probably": 437, "side-effects": 26, "enum": 235, "typeconverter.merge": 1, "logleveltypeconverter.feature.size/l": 1, "lint/percentstringarray": 3, "lint/percentsymbolarray": 2, "cops": 145, "cop": 1520, "lint/percentstring": 1, "colons": 14, "commas": 37, "foo": 1028, "bar": 800, "quotes": 301, "w": 297, "'foo": 139, "likely": 191, "characters": 516, "unintended": 22, "mistranslating": 1, "literals": 85, "percent": 32, "notation": 36, "rather": 668, "meant": 147, "resulting": 203, "strings/symbols": 1, "conventions": 140, "offenses": 425, "v1.x": 174, "cv": 22, "onnxruntime": 38, "bert": 18, "gluonnlp": 3, "onnx": 574, "wrap": 212, "try/finally": 7, "convert": 465, "posixpath": 2, "str": 170, "pytest-compatible": 1, "with_seed": 4, "decorate": 18, "random": 470, "seed": 130, "assert": 228, "outputs": 136, "accurate": 103, "pr-awaiting-merge": 6, "clonenode": 15, "typeannotation": 6, "+": 5678, "tomdoc": 6, "fill": 125, "piece": 44, "commands/build.rb": 2, "41.": 1, "somehow": 66, "left": 520, "e746b3b": 1, ".frozen-due-to-age": 71, ":commands": 10, ":buildbuild": 1, "index.md": 24, "hello": 176, "contributing": 173, "overall": 92, "simplify": 459, "text": 1359, "favorite": 6, "love": 62, "accessible": 104, "intro": 32, "bullet": 15, "pts": 1, "text.remove": 4, "front": 210, "matter.revert": 1, "paragraph": 79, "flow.revert": 1, "sentence.documentation.frozen-due-to-age": 1, "feat": 771, "pkger": 114, "extend": 302, "stacks": 42, "uninstall": 48, "ability": 654, "resources": 411, "associated": 235, "stack": 412, "reduce": 786, "allocations": 214, "categories": 175, "union": 133, "defaulting": 29, "categories.fix.memory-optimization": 1, "zap": 47, "static": 1106, "generation": 278, "_n_": 1, "n": 649, "accordingly": 79, "variables.area/documentation.kind/bug/fix.size/s": 1, "non": 255, "able": 797, "override-cmd": 2, "validate": 360, "echo": 184, "world-1194-26292": 1, "area/cli.kind/bug/fix.size/s": 8, "don": 19, "t": 707, "doafterterminate": 5, "callback": 336, "single": 1225, "mentioned": 137, "stackoverflow": 30, "question": 151, "rxjava2": 4, "strong": 64, "experimental": 1512, ".x.enhancement": 1, "single.doafterterminate": 7, "symbol": 269, "html": 553, "upgrading.md": 11, "introduced": 404, "sha": 4182, "fixing": 676, "maruku": 42, "kramdown": 119, "markdown": 383, "compact": 81, "rows": 419, "variant": 111, ".bigtable": 11, "bigtables": 5, "vertical": 149, "padding": 269, "class=": 174, "bigtable": 4, "enabled": 944, "applied": 329, "iconsize": 3, "small.ready-for-merge.rfe.web-ui": 1, "webprofilerbundle": 87, "content-security-policy": 16, "compatibility": 643, "style-src": 6, "'self": 5, "policy": 507, "review.webprofilerbundle": 24, "nzbget": 6, "tvcategory": 5, "references": 433, "moviecategory": 6, "todo": 440, "moviecategory.update": 2, "blockchain": 7, ":bitcoin": 2, ":blockchain": 8, ":ethereum": 4, ":tezos": 14, "deprecate": 536, ":bitcoin.deprecate": 1, ":ethereum.deprecate": 1, ":tezos.update": 1, "unreleased_readme.md.minor": 1, "fixes.deprecation": 1, "index": 1430, "bounds": 100, "datasets": 109, "isdatasetvisible": 3, "within": 741, "datasets.add": 1, "isdatasetvisible.type": 1, "hold": 86, "matched": 92, "route": 496, "context": 1140, "proposed": 208, "handler": 468, "lambda": 135, ".handlername": 1, "become": 151, "lean": 4, "becomes": 118, "easy": 276, "analyse": 17, "trying": 571, "routes": 243, "being": 2278, "alternatives": 54, "wrapper": 212, "definition": 460, "func": 251, "logget": 2, "router": 232, "gin.engine": 1, "gin.context": 28, "router.get": 1, "c": 1543, "//": 1349, "/user/": 1, "c.status": 1, "200": 48, "doable": 4, "considering": 70, "gin": 29, "structures": 77, "might": 902, "expose": 287, "p.s": 28, "contains": 706, "certain": 273, "nodevalue": 1, "getvalue": 7, "method.hold": 1, "context.merge": 3, "absolute-path-context.add": 1, "example.break-backward.enhancement.feature.need-review": 1, "brazilian": 40, "portuguese": 57, "language": 548, "content": 1280, "manager": 355, "e-mail": 91, "settings": 985, "permissions": 295, "support.merge": 11, "language-pt_br.source": 1, "ios": 255, "leak": 321, "navigation.removepage": 4, "masterdetailpage.detail": 2, "navigationpage": 24, "contentpage": 18, "scenario": 212, "toolbaritems": 7, "therefore": 318, "viewcontroller": 4, "explicitly": 497, "disposed": 99, "disposing": 45, "removepage": 11, "memoryleak": 7, ".+": 107, "attribute.merge": 1, "patch-9.approved.p/ios": 1, "eslint": 283, "apppath": 6, "moves": 210, "apppath.cla": 1, "pstoken": 2, "continue": 302, "tracking": 182, "future": 628, "regressions": 43, "s": 1923, "experience": 691, "tooling": 538, "perspective": 538, "enumerated": 513, "concerns": 543, "summary": 930, "impact": 1750, "editor": 1331, "services": 1355, "vscode": 1147, "psscriptanalyzer": 527, "provides": 1342, "linting": 724, "formatting": 1074, "extensions": 809, "editorsyntax": 525, "highlighting": 617, "editors": 542, "token": 790, "entries.backport-7.1.x-done.cl-engine": 1, "psparser": 1, "organizationunitrole": 6, "permission": 252, "entitychangedeventdata": 1, "abpuserpermissioncacheiteminvalidator.problem": 1, "permisison": 1, "sphinx": 87, "tutorials": 96, "tocs": 2, "contents": 173, "throwing": 149, "/home/ubuntu/incubator-mxnet/docs/tutorials/index.md:1": 1, "toctree": 14, "directive": 104, "hidden": 368, "basic/index.md": 1, "c++/index.md": 1, "control_flow/index.md": 1, "embedded/index.md": 1, "gluon/index.md": 1, "nlp/index.md": 1, "onnx/index.md": 1, "python/index.md": 1, "r/index.md": 1, "scala/index.md": 1, "sparse/index.md": 1, "speech_recognition/index.md": 1, "tensorrt/index.md": 1, "unsupervised_learning/index.md": 1, "vision/index.md": 1, "/home/ubuntu/incubator-mxnet/docs/install/amazonlinux_setup.md": 1, "/home/ubuntu/incubator-mxnet/docs/install/build_from_source.md": 1, "/home/ubuntu/incubator-mxnet/docs/install/c_plus_plus.md": 1, "/home/ubuntu/incubator-mxnet/docs/install/centos_setup.md": 1, "/home/ubuntu/incubator-mxnet/docs/install/download.md": 1, "/home/ubuntu/incubator-mxnet/docs/install/osx_setup.md": 1, "/home/ubuntu/incubator-mxnet/docs/install/raspbian_setup.md": 1, "/home/ubuntu/incubator-mxnet/docs/install/tx2_setup.md": 1, "/home/ubuntu/incubator-mxnet/docs/install/ubuntu_setup.rst": 1, "/home/ubuntu/incubator-mxnet/docs/install/validate_mxnet.md": 1, "/home/ubuntu/incubator-mxnet/docs/install/windows_setup.md": 1, "toc.fix": 1, "toc": 38, "errors.pr-awaiting-review": 1, "total": 324, "worker": 587, "improvements": 541, "delete": 868, "against": 462, "datatype": 45, "deleting": 192, "authorisation": 3, "param": 441, "policies": 106, "attributes": 534, "deleted_at": 17, "basepolicy": 3, "author_id": 5, "postpolicy": 2, "v1.3.check": 1, "boundary": 86, "timestamp": 303, "reported": 317, "cleanup": 901, "calls": 1178, "gettypeinfo": 11, "generated": 832, ".resx": 4, "tool": 254, "resgen": 7, "sessionstate.cs": 1, "compiler.cs": 8, "engine\\runtime": 1, "variableanalysis.cs": 1, "classops.cs": 1, "perf": 187, "mutabletuple.cs": 1, "indexing": 51, "linq": 16, "interactively": 584, "several": 383, "bash": 170, "code-block": 7, "ubuntu.md": 3, "exports": 118, ".bashrc": 6, "spaces": 384, "none": 694, "semver": 59, "documentation.frozen-due-to-age": 36, "facebook": 37, "delete_post": 2, "crept": 3, "posts": 366, "arb": 2, "somewhat": 62, "activeadmin": 16, "popularity": 14, "parallel": 356, "generates": 322, ".arb": 1, "defaults.set": 2, "defaults.set.review": 1, "update.record.type": 1, "stop": 605, "logged": 134, "continues": 45, "error.style": 1, "reformat": 32, "junit": 79, "reporter": 81, "reports": 170, "rng-seed": 6, "redis": 469, "crashing": 123, "ray_check": 5, "gcs": 119, "heart": 13, "ray": 327, "cluster": 447, "bad": 499, "ray_log": 1, "fatal": 130, "reply": 86, "sends": 88, "ray_redis_module": 1, "stability": 66, "s3": 89, "depends": 125, "residing": 6, "joindiaspora": 5, "amazon": 76, "account": 844, "unneded": 8, "external": 348, "leaking": 52, "makes": 1314, "assumes": 95, "agrees": 3, "distribution": 136, "storage.changing": 1, "assets": 210, "dx": 540, "despite": 67, "previously": 684, "check_trailing_spaces.sh": 2, "script": 1254, "belong": 48, "diverse": 6, "composer.lock": 9, "development": 317, ".idea": 6, "previous": 723, "exclude": 285, "non-project": 3, "larger": 139, "blacklist": 47, "paths": 621, "prominently": 2, "-not": 25, "-path": 56, "./.git/": 4, "contradictory": 4, "managed": 130, "git": 555, "totally": 63, "pretty": 241, "verbose": 204, "care": 141, "nature": 32, "operates": 10, "file-system": 5, "level": 671, "knows": 47, ".gitignore": 109, "utility": 189, "namely": 45, "git-ls-files": 1, "obtain": 39, "findutils": 2, "xargs": 18, "crafted": 11, "paths/files": 2, "fixtures": 61, "tests/fixtures/": 2, "reduced": 118, "benefit": 95, "results": 1054, "much": 616, "git-grep": 1, "exec-call": 1, "grep": 125, "gits": 2, "powerful": 23, "post-processing": 14, "sed": 73, "check-script": 1, "expression": 716, "keyword": 298, "loc": 27, "indication": 35, "formatters": 25, "highlighted": 38, "spans": 27, "beyond": 54, "region": 206, "codeclimate": 33, "ellipses": 5, "formatter": 138, "expand": 172, "button": 1000, "show": 1473, "highlighted_area": 3, "loc.only": 1, "access": 1009, "locations": 75, "nodes.add": 4, "span": 189, "line.add": 4, "returns": 816, "portion": 36, "rllib": 307, "sac": 40, "squashedgaussian": 2, "hardcoded": 140, "squashed": 17, "normal": 261, "shared": 308, "model/tf/tf_action_dist": 1, "lagos": 1, "well": 1125, "simplifies": 37, "\u0001": 57, "rllib/utils/schedules/schedule.py.default": 4, "evaluation_config": 4, "exploration=false": 4, "auto-exploration-disable": 4, "constructing": 50, "eval-policies": 4, "'origin/exploration_api_epsilon_greedy": 4, "exploration_api_epsilon_greedy": 4, "discrete": 29, "evolution": 4, "dictionaries": 23, "resourcedictionaries": 10, "visualelement": 35, "icollection": 3, "mergeddictionaries": 3, "resourcedictionary.cs": 2, "behavioral": 166, "addition": 374, "resourcedictionary": 7, "omitted": 268, "consolidate": 243, "validator": 405, "expressionvalidator": 5, "object_to_string": 3, "message.bug.feature.status": 1, "reviewed.validator": 67, "charset": 152, "content-type": 137, "webrick": 28, "encoding": 423, "servlet": 10, "unecessary": 23, "served": 54, "strictly": 42, "nginx": 43, "cleans": 51, "merges": 44, "interface": 899, "slightly": 210, "speedier.": 1, "speedier": 2, "frozen-due-to-age": 268, "concept": 79, "passport": 24, "badges": 72, "tbd": 42, "critical": 76, "element": 537, "determines": 29, "required_badges": 2, "setting": 1499, "applications": 154, "feature.ready.security.status": 1, "domain": 457, "privilege": 132, "success": 162, "debug": 935, "optimize": 479, "maybe.hide": 4, "marble": 102, "diagram": 131, "diagram.2.x.documentation": 1, "reactui": 1, "togglers": 3, "tabs": 285, "checkboxes": 52, "react": 382, "alerts": 125, "request_resources": 12, "internal": 965, "kv": 276, "pub": 8, "wip.upat": 1, "suppression": 30, "gender-neutral": 4, "traductions": 1, "fr.make": 1, "es": 47, "confirmation": 128, "french": 80, "spanish": 55, "blog": 134, "slack": 128, "links": 1135, "vuepress": 21, "configurations": 219, "slack.source": 1, "priority": 373, "class_definition": 3, "vs": 293, "braces": 102, "braces.kind/enhancement": 1, "streaming": 233, "scopes": 78, "application": 579, "tokens": 383, "through": 909, "sec-websocket-protocol": 6, "oauth": 66, "api.use": 2, "websocket": 108, "endpoints": 157, "merely": 13, "requiring": 97, "websockets": 26, "protocol": 253, "negotiation": 10, "specify": 544, "set-service": 32, "-status": 3, "-stop": 1, "-force": 23, "dependent": 104, "raise": 275, "dependents": 5, "force": 396, "b2f84e954dbf686d418f482b83837864136d01fd": 1, "committee-reviewed": 1, "lowercasestaticreferencefixer": 9, "parent": 579, "word": 258, "\\": 651, "parent\\": 1, "namespace.kind/bug": 3, "maxmodels": 3, "criteria": 21, "increase": 320, "slower": 78, "machine": 346, "test.merge": 80, "automlunittest": 1, "color-code": 2, "9": 181, "table.docs": 2, "coded": 32, "ie8": 24, "browser": 441, "messenger": 214, "amazonsqstransport": 11, "injectable": 7, "symfony/symfony-docs": 97, "pure": 79, "refactoring": 301, "enables": 232, "flexibility": 31, "injection": 64, "behaviour": 423, "backwards": 146, "sender": 106, "inject": 107, "symfony\\component\\messenger\\bridge\\amazonsqs\\transport\\amazonsqstransport": 1, "recommended": 106, ":create": 70, "recommed": 1, "obliges": 1, "transport": 251, "symfony\\component\\messenger\\bridge\\amazonsqs\\transport\\amazonsqstransportfactory": 1, ":fromdsn": 4, "dsn": 107, "serializer": 225, "amazonsqsreceiver": 1, "amazonsqssender": 1, "factory": 191, "essential": 18, "certainly": 39, "implementation": 1273, "suited": 6, "i.e": 283, "messy": 18, "optionality": 4, "minimal": 109, "symfony\\component\\messenger\\transport\\serialization\\phpserializer": 1, "passed": 844, "injected": 74, "ever": 115, "recommend": 81, "injectable.feature.messenger.status": 1, "parsed": 197, "utilities": 159, "starting": 369, "tree": 329, "regexpnodeparsed_tree": 1, "caches": 70, "reparsing": 2, "regexpnodeeach_capture": 4, "processing": 710, "hesitating": 1, "rubocop-ast": 7, "extending": 85, "parsed_tree": 2, ".use": 42, ".auto-merge": 1, "jekyll-pug": 5, "listing": 97, "official": 175, "website": 201, "user-friendly": 13, "instructions": 484, "beginner": 11, "soon": 120, "basic": 474, "converter": 63, "supports": 559, "layouts": 124, "upcoming": 51, "pug": 21, "loops": 87, "statements": 309, "equivalent": 146, "plugins.md": 21, "14864": 1, "log.cl-docs": 1, "tag": 963, "a-tag": 1, "prototype.js": 3, "cover": 164, "element.xxxclassname": 3, "hudson-behavior": 2, "vanilla": 25, "javascript": 193, "pagination": 191, "ticket": 53, "adjustment": 36, "mxnet-554": 1, "ccache": 20, "reporting": 165, "diagnostic": 20, "tried": 294, "balance": 23, "actionable": 12, "logs": 501, "1.x": 254, "cuda": 341, "graphs": 62, "trt": 15, "fp32": 32, "fp16": 36, "graph": 220, "int8": 74, "complex": 153, "tests.kind/enhancement.topic/tests": 3, "initialize": 196, "abp": 33, "window.abp": 2, "emphasis": 14, "select-string": 29, "-emphasize": 3, "-allmatches": 1, "-simplematch": 2, "negative": 256, "escape": 287, "sequence": 294, "easier": 514, "distinguish": 77, "looking": 334, "cmdlet": 237, "-color": 4, "-allmatch": 1, "red": 71, "text.apply": 1, "refactored": 152, "moved": 568, "sequence.cl-general.committee-reviewed.hacktoberfest": 1, "-noemphasize": 1, "colorize": 18, "obj": 128, "reg": 27, "squarederror": 6, "learner": 27, "defining": 126, "dump": 297, "size": 1219, "favor": 157, "example.pr-awaiting-review": 1, "auto": 419, "encrypt": 73, "dnssan": 6, "ipsan": 5, "agent": 570, "requesting": 65, "auto_encrypt": 51, "certs": 57, "cert": 149, "consul.io": 2, "|": 11477, "openssl": 104, "s_client": 6, "-connect": 6, "localhost:8501": 1, "/dev/null": 13, "x509": 8, "-text": 1, "certificate": 276, "0x2": 24, "serial": 122, "0xb": 6, "signature": 339, "algorithm": 261, "ecdsa-with-sha256": 2, "issuer": 16, "cn=pri-9ioo0o5x.consul.ca.c1ce7653.consul": 1, "validity": 30, "jan": 24, "10:50:46": 2, "gmt": 21, "cn=c1.agnt.c1ce7653.consul": 1, "key": 1942, "id-ecpublickey": 1, "public-key": 2, "256": 11, "04:48": 1, "da": 5, "ae:28": 1, "fc": 27, "b5:2e": 1, "f6:63": 1, "d3:0b:58:29": 1, "e6": 2, "71": 12, "d4:1f": 1, "ab": 17, "f9": 7, "df": 12, "e5": 3, "e6:79": 1, "be:6a:05:97:92": 1, "95:34": 1, "c0:0f": 1, "d6:91:79": 1, "bc:67": 1, "e8": 8, "db:7b": 1, "bb:0a:1c": 1, "1e": 9, "a9": 5, "c8": 3, "de:2a": 1, "b6": 1, "ed:66:64:40:3d:38": 1, "c2:3f": 1, "d0:63:6b": 1, "c9": 2, "b9": 1, "asn1": 3, "oid": 25, "prime256v1": 1, "nist": 1, "curve": 11, "p": 250, "x509v3": 7, "digital": 47, "encipherment": 3, "agreement": 106, "extended": 152, "tls": 676, "constraints": 275, "ca": 750, "identifier": 233, "f3": 8, "a0:08:64": 2, "c7:4f": 2, "d6:64:33:92:93": 2, "c8:6e:65": 2, "c0": 17, "b0": 6, "d7:74:3d:95": 2, "d0:1c:1e:50:18": 2, "fb:9a": 2, "b3": 6, "authority": 9, "keyid": 5, "dns": 287, "ip": 369, "address:0:0:0:0:0:0:0:0": 1, "uri": 272, "spiffe": 1, "//c1ce7653-457a-7942-f7a3-fedb029b7fc2.consul/agent/client/dc/dc1/id/c1": 1, "30:45:02:21:00": 1, "b6:11": 1, "b7:96": 1, "ef:98": 1, "ca:55": 1, "f1:73": 1, "f7:1d": 1, "a1": 5, "ad:07": 1, "ba": 4, "d8:2c:41": 1, "c9:67:9c:0f": 1, "ca:88:15:40": 1, "e7": 8, "ee:93:23": 1, "72:02:20:09": 1, "f5:27": 1, "f0": 1, "fc:02": 1, "a8:40": 1, "ef:06": 1, "e6:28": 1, "b5": 1, "35": 12, "b3:22:1d:50:27:75": 1, "a0:6b": 1, "c4:36:30": 1, "de": 64, "bb:00": 1, "san": 13, "configurable": 264, "vault": 24, "aws": 195, "pca": 1, "assigns": 13, "createcsrwithsan.use": 1, "createcsrwithsan": 2, "cache.copy": 1, "dnsnames": 1, "ipaddresses": 1, "cert.verify": 1, "auto_encrypt.sign": 1, "san.provide": 1, "ipsan.rename": 1, "createcsr": 1, "errorbase": 3, ":takeunderlyingerror": 3, "const": 619, "newer": 156, "llvm/clang": 2, "oss-fuzz": 3, "member": 247, "std": 593, ":move": 7, "qualifier": 7, "bug.build.oss-fuzz": 1, "layout.createfromstring": 2, "throwconfigexceptions": 3, "people": 468, "globally": 85, "logmanager.throwexceptions": 1, "perform": 200, "layout-validation": 1, "funclayoutrenderer-tests": 2, "simplelayoutparsertests": 1, "convinced": 10, "trycreatefromstring": 1, "allowed": 498, "throw": 707, "throwconfigexceptions-parameter": 1, "simplelayoutparsertests.api.documentation": 1, "done.enhancement.needs": 7, "wiki.size/l.squash": 2, "layout.fromstring": 1, "layout": 656, "parser": 840, "no-babelrc": 6, "babel-node": 39, "y": 534, "y/y": 32, "corresponding": 196, "option.fix": 8, "condition": 655, "babelrc.fix": 1, "logplugin": 1, "in-files.merge": 1, "feat-no-babelrc-babel-node.fix": 1, "file.fix": 25, "correctly.pr": 1, "rocket": 177, "contributors": 136, "maintainers": 111, "submitting-pull-requests": 1, "guide.newline": 1, "eof.update": 1, "docs/content/contributing/maintainers.md": 1, "stderr": 145, "stdout": 132, "netdata": 663, "groups": 280, "sections": 109, "getpwuid": 2, "getgrgid": 2, "monitor": 201, "processes": 227, "outside": 333, "/etc/passwd": 3, "/etc/group": 1, "fall": 85, "/etc": 7, "mounted": 64, "-v": 107, "/host/etc": 1, "ro": 15, "apps": 179, "file.separate": 1, "modification": 111, "check.read": 1, "file.update": 22, "documentation.use": 8, "containter.fix": 1, "volume": 84, "mounting": 52, 